README.org
#+TITLE: Notas en Org-Mode
#+AUTHOR: Mou
#+DATE: [2025-08-28]

* Descripción

Este directorio contiene la conversión de mis notas de Quarto a org-mode. Las notas incluyen:

- *AI/*: Notas sobre Inteligencia Artificial (CS229, DataCamp Transformers)
- *HoTT/*: Notas sobre Homotopy Type Theory

* Estructura del Proyecto

#+BEGIN_EXAMPLE
org-mode-notes/
├── index.org              # Página principal
├── AI/                    # Notas de IA
│   ├── index.org
│   ├── CS229/
│   │   ├── index.org
│   │   └── AprendizajeSupervisado/
│   │       ├── aprendizaje_supervisado.org
│   │       ├── regresion_lineal.org
│   │       └── Imagenes/
│   └── DataCamp/
│       ├── index.org
│       ├── desglosando_el_transformer.org
│       └── embedding_y_codificacion_posicional.org
├── HoTT/                  # Notas de HoTT
│   ├── index.org
│   ├── introduccion.org
│   └── juicios.org
├── publish.el             # Configuración de publicación
├── Makefile               # Automatización de tareas
└── README.org             # Este archivo
#+END_EXAMPLE

* Uso

** Generar el sitio web

Para generar el sitio web desde los archivos org:

#+BEGIN_SRC bash
make publish
#+END_SRC

** Servir localmente

Para generar y servir el sitio localmente:

#+BEGIN_SRC bash
make serve
#+END_SRC

Esto iniciará un servidor HTTP en http://localhost:8080

** Limpiar archivos generados

#+BEGIN_SRC bash
make clean
#+END_SRC

* Configuración de Emacs

Si quieres publicar desde Emacs, puedes usar:

#+BEGIN_SRC emacs-lisp
(load-file "publish.el")
(org-publish-all)
#+END_SRC

* Características

- Soporte completo para LaTeX/MathJax
- Navegación entre notas con enlaces org-mode
- Generación automática de tabla de contenidos
- Estilo CSS responsivo
- Sitemap automático