_site/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-27 Wed 21:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notas en Org-Mode</title>
<meta name="author" content="Mou" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-brand">
    <a href="/index.html">🏠 Mis Notas</a>
  </div>
  <div class="navbar-menu">
    <div class="navbar-item dropdown">
      <a href="#" class="dropbtn">🤖 AI</a>
      <div class="dropdown-content">
        <a href="/AI/index.html">📋 Resumen</a>
        <div class="dropdown-submenu">
          <a href="#" class="submenu-btn">📚 CS229 ▶</a>
          <div class="submenu-content">
            <a href="/AI/CS229/index.html">📋 Resumen</a>
            <a href="/AI/CS229/AprendizajeSupervisado/aprendizaje_supervisado.html">🎯 Aprendizaje Supervisado</a>
            <a href="/AI/CS229/AprendizajeSupervisado/regresion_lineal.html">📈 Regresión Lineal</a>
          </div>
        </div>
        <div class="dropdown-submenu">
          <a href="#" class="submenu-btn">🏗️ DataCamp ▶</a>
          <div class="submenu-content">
            <a href="/AI/DataCamp/index.html">📋 Resumen</a>
            <a href="/AI/DataCamp/desglosando_el_transformer.html">🔍 Desglosando el Transformer</a>
            <a href="/AI/DataCamp/embedding_y_codificacion_posicional.html">🔗 Embedding y Codificación Posicional</a>
          </div>
        </div>
      </div>
    </div>
    <div class="navbar-item dropdown">
      <a href="#" class="dropbtn">🔬 HoTT</a>
      <div class="dropdown-content">
        <a href="/HoTT/index.html">📋 Resumen</a>
        <a href="/HoTT/introduccion.html">🚀 Introducción</a>
        <a href="/HoTT/juicios.html">⚖️ Juicios</a>
      </div>
    </div>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Notas en Org-Mode</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8a04aff">1. Descripción</a></li>
<li><a href="#org6e5b3a9">2. Estructura del Proyecto</a></li>
<li><a href="#org9b13b25">3. Uso</a>
<ul>
<li><a href="#org12265bf">3.1. Generar el sitio web</a></li>
<li><a href="#org1ca184e">3.2. Servir localmente</a></li>
<li><a href="#org257dc8c">3.3. Limpiar archivos generados</a></li>
</ul>
</li>
<li><a href="#orge727c20">4. Configuración de Emacs</a></li>
<li><a href="#org37113e1">5. Características</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8a04aff" class="outline-2">
<h2 id="org8a04aff"><span class="section-number-2">1.</span> Descripción</h2>
<div class="outline-text-2" id="text-1">
<p>
Este directorio contiene la conversión de mis notas de Quarto a org-mode. Las notas incluyen:
</p>

<ul class="org-ul">
<li><b>AI/</b>: Notas sobre Inteligencia Artificial (CS229, DataCamp Transformers)</li>
<li><b>HoTT/</b>: Notas sobre Homotopy Type Theory</li>
</ul>
</div>
</div>
<div id="outline-container-org6e5b3a9" class="outline-2">
<h2 id="org6e5b3a9"><span class="section-number-2">2.</span> Estructura del Proyecto</h2>
<div class="outline-text-2" id="text-2">
<pre class="example" id="org40c9bc8">
org-mode-notes/
├── index.org              # Página principal
├── AI/                    # Notas de IA
│   ├── index.org
│   ├── CS229/
│   │   ├── index.org
│   │   └── AprendizajeSupervisado/
│   │       ├── aprendizaje_supervisado.org
│   │       ├── regresion_lineal.org
│   │       └── Imagenes/
│   └── DataCamp/
│       ├── index.org
│       ├── desglosando_el_transformer.org
│       └── embedding_y_codificacion_posicional.org
├── HoTT/                  # Notas de HoTT
│   ├── index.org
│   ├── introduccion.org
│   └── juicios.org
├── publish.el             # Configuración de publicación
├── Makefile               # Automatización de tareas
└── README.org             # Este archivo
</pre>
</div>
</div>
<div id="outline-container-org9b13b25" class="outline-2">
<h2 id="org9b13b25"><span class="section-number-2">3.</span> Uso</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org12265bf" class="outline-3">
<h3 id="org12265bf"><span class="section-number-3">3.1.</span> Generar el sitio web</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Para generar el sitio web desde los archivos org:
</p>

<div class="org-src-container">
<pre class="src src-bash">make publish
</pre>
</div>
</div>
</div>
<div id="outline-container-org1ca184e" class="outline-3">
<h3 id="org1ca184e"><span class="section-number-3">3.2.</span> Servir localmente</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Para generar y servir el sitio localmente:
</p>

<div class="org-src-container">
<pre class="src src-bash">make serve
</pre>
</div>

<p>
Esto iniciará un servidor HTTP en <a href="http://localhost:8080">http://localhost:8080</a>
</p>
</div>
</div>
<div id="outline-container-org257dc8c" class="outline-3">
<h3 id="org257dc8c"><span class="section-number-3">3.3.</span> Limpiar archivos generados</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-bash">make clean
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge727c20" class="outline-2">
<h2 id="orge727c20"><span class="section-number-2">4.</span> Configuración de Emacs</h2>
<div class="outline-text-2" id="text-4">
<p>
Si quieres publicar desde Emacs, puedes usar:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(load-file "publish.el")
(org-publish-all)
</pre>
</div>
</div>
</div>
<div id="outline-container-org37113e1" class="outline-2">
<h2 id="org37113e1"><span class="section-number-2">5.</span> Características</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Soporte completo para LaTeX/MathJax</li>
<li>Navegación entre notas con enlaces org-mode</li>
<li>Generación automática de tabla de contenidos</li>
<li>Estilo CSS responsivo</li>
<li>Sitemap automático</li>
</ul>
</div>
</div>
</div>
</body>
</html>
